load-testing/my-reports/feed-run1-ff-off.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * feed: 100 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   1% ] 100 VUs  0m01.0s/2m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   2% ] 100 VUs  0m02.0s/2m0s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   2% ] 100 VUs  0m03.0s/2m0s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   3% ] 100 VUs  0m04.0s/2m0s

running (0m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   4% ] 100 VUs  0m05.0s/2m0s

running (0m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
feed   [   5% ] 100 VUs  0m06.0s/2m0s

running (0m07.0s), 100/100 VUs, 848 complete and 0 interrupted iterations
feed   [   6% ] 100 VUs  0m07.0s/2m0s

running (0m08.0s), 100/100 VUs, 1776 complete and 0 interrupted iterations
feed   [   7% ] 100 VUs  0m08.0s/2m0s

running (0m09.0s), 100/100 VUs, 2673 complete and 0 interrupted iterations
feed   [   7% ] 100 VUs  0m09.0s/2m0s

running (0m10.0s), 100/100 VUs, 3529 complete and 0 interrupted iterations
feed   [   8% ] 100 VUs  0m10.0s/2m0s

running (0m11.0s), 100/100 VUs, 4435 complete and 0 interrupted iterations
feed   [   9% ] 100 VUs  0m11.0s/2m0s

running (0m12.0s), 100/100 VUs, 5348 complete and 0 interrupted iterations
feed   [  10% ] 100 VUs  0m12.0s/2m0s

running (0m13.0s), 100/100 VUs, 6281 complete and 0 interrupted iterations
feed   [  11% ] 100 VUs  0m13.0s/2m0s

running (0m14.0s), 100/100 VUs, 7222 complete and 0 interrupted iterations
feed   [  12% ] 100 VUs  0m14.0s/2m0s

running (0m15.0s), 100/100 VUs, 8171 complete and 0 interrupted iterations
feed   [  12% ] 100 VUs  0m15.0s/2m0s

running (0m16.0s), 100/100 VUs, 9027 complete and 0 interrupted iterations
feed   [  13% ] 100 VUs  0m16.0s/2m0s

running (0m17.0s), 100/100 VUs, 9600 complete and 0 interrupted iterations
feed   [  14% ] 100 VUs  0m17.0s/2m0s

running (0m18.0s), 100/100 VUs, 10567 complete and 0 interrupted iterations
feed   [  15% ] 100 VUs  0m18.0s/2m0s

running (0m19.0s), 100/100 VUs, 11485 complete and 0 interrupted iterations
feed   [  16% ] 100 VUs  0m19.0s/2m0s

running (0m20.0s), 100/100 VUs, 12414 complete and 0 interrupted iterations
feed   [  17% ] 100 VUs  0m20.0s/2m0s

running (0m21.0s), 100/100 VUs, 13324 complete and 0 interrupted iterations
feed   [  17% ] 100 VUs  0m21.0s/2m0s

running (0m22.0s), 100/100 VUs, 14281 complete and 0 interrupted iterations
feed   [  18% ] 100 VUs  0m22.0s/2m0s

running (0m23.0s), 100/100 VUs, 15207 complete and 0 interrupted iterations
feed   [  19% ] 100 VUs  0m23.0s/2m0s

running (0m24.0s), 100/100 VUs, 16124 complete and 0 interrupted iterations
feed   [  20% ] 100 VUs  0m24.0s/2m0s

running (0m25.0s), 100/100 VUs, 17041 complete and 0 interrupted iterations
feed   [  21% ] 100 VUs  0m25.0s/2m0s

running (0m26.0s), 100/100 VUs, 17962 complete and 0 interrupted iterations
feed   [  22% ] 100 VUs  0m26.0s/2m0s

running (0m27.0s), 100/100 VUs, 18942 complete and 0 interrupted iterations
feed   [  22% ] 100 VUs  0m27.0s/2m0s

running (0m28.0s), 100/100 VUs, 19842 complete and 0 interrupted iterations
feed   [  23% ] 100 VUs  0m28.0s/2m0s

running (0m29.0s), 100/100 VUs, 20806 complete and 0 interrupted iterations
feed   [  24% ] 100 VUs  0m29.0s/2m0s

running (0m30.0s), 100/100 VUs, 21753 complete and 0 interrupted iterations
feed   [  25% ] 100 VUs  0m30.0s/2m0s

running (0m31.0s), 100/100 VUs, 22655 complete and 0 interrupted iterations
feed   [  26% ] 100 VUs  0m31.0s/2m0s

running (0m32.0s), 100/100 VUs, 23595 complete and 0 interrupted iterations
feed   [  27% ] 100 VUs  0m32.0s/2m0s

running (0m33.0s), 100/100 VUs, 24562 complete and 0 interrupted iterations
feed   [  27% ] 100 VUs  0m33.0s/2m0s

running (0m34.0s), 100/100 VUs, 25500 complete and 0 interrupted iterations
feed   [  28% ] 100 VUs  0m34.0s/2m0s

running (0m35.0s), 100/100 VUs, 26424 complete and 0 interrupted iterations
feed   [  29% ] 100 VUs  0m35.0s/2m0s

running (0m36.0s), 100/100 VUs, 27411 complete and 0 interrupted iterations
feed   [  30% ] 100 VUs  0m36.0s/2m0s

running (0m37.0s), 100/100 VUs, 28317 complete and 0 interrupted iterations
feed   [  31% ] 100 VUs  0m37.0s/2m0s

running (0m38.0s), 100/100 VUs, 29260 complete and 0 interrupted iterations
feed   [  32% ] 100 VUs  0m38.0s/2m0s

running (0m39.0s), 100/100 VUs, 30230 complete and 0 interrupted iterations
feed   [  32% ] 100 VUs  0m39.0s/2m0s

running (0m40.0s), 100/100 VUs, 31160 complete and 0 interrupted iterations
feed   [  33% ] 100 VUs  0m40.0s/2m0s

running (0m41.0s), 100/100 VUs, 32130 complete and 0 interrupted iterations
feed   [  34% ] 100 VUs  0m41.0s/2m0s

running (0m42.0s), 100/100 VUs, 33043 complete and 0 interrupted iterations
feed   [  35% ] 100 VUs  0m42.0s/2m0s

running (0m43.0s), 100/100 VUs, 33974 complete and 0 interrupted iterations
feed   [  36% ] 100 VUs  0m43.0s/2m0s

running (0m44.0s), 100/100 VUs, 34885 complete and 0 interrupted iterations
feed   [  37% ] 100 VUs  0m44.0s/2m0s

running (0m45.0s), 100/100 VUs, 35859 complete and 0 interrupted iterations
feed   [  37% ] 100 VUs  0m45.0s/2m0s

running (0m46.0s), 100/100 VUs, 36791 complete and 0 interrupted iterations
feed   [  38% ] 100 VUs  0m46.0s/2m0s

running (0m47.0s), 100/100 VUs, 37727 complete and 0 interrupted iterations
feed   [  39% ] 100 VUs  0m47.0s/2m0s

running (0m48.0s), 100/100 VUs, 38634 complete and 0 interrupted iterations
feed   [  40% ] 100 VUs  0m48.0s/2m0s

running (0m49.0s), 100/100 VUs, 39544 complete and 0 interrupted iterations
feed   [  41% ] 100 VUs  0m49.0s/2m0s

running (0m50.0s), 100/100 VUs, 40503 complete and 0 interrupted iterations
feed   [  42% ] 100 VUs  0m50.0s/2m0s

running (0m51.0s), 100/100 VUs, 41444 complete and 0 interrupted iterations
feed   [  42% ] 100 VUs  0m51.0s/2m0s

running (0m52.0s), 100/100 VUs, 42346 complete and 0 interrupted iterations
feed   [  43% ] 100 VUs  0m52.0s/2m0s

running (0m53.0s), 100/100 VUs, 43315 complete and 0 interrupted iterations
feed   [  44% ] 100 VUs  0m53.0s/2m0s

running (0m54.0s), 100/100 VUs, 44251 complete and 0 interrupted iterations
feed   [  45% ] 100 VUs  0m54.0s/2m0s

running (0m55.0s), 100/100 VUs, 45217 complete and 0 interrupted iterations
feed   [  46% ] 100 VUs  0m55.0s/2m0s

running (0m56.0s), 100/100 VUs, 46164 complete and 0 interrupted iterations
feed   [  47% ] 100 VUs  0m56.0s/2m0s

running (0m57.0s), 100/100 VUs, 47066 complete and 0 interrupted iterations
feed   [  47% ] 100 VUs  0m57.0s/2m0s

running (0m58.0s), 100/100 VUs, 48000 complete and 0 interrupted iterations
feed   [  48% ] 100 VUs  0m58.0s/2m0s

running (0m59.0s), 100/100 VUs, 48966 complete and 0 interrupted iterations
feed   [  49% ] 100 VUs  0m59.0s/2m0s

running (1m00.0s), 100/100 VUs, 49878 complete and 0 interrupted iterations
feed   [  50% ] 100 VUs  1m00.0s/2m0s

running (1m01.0s), 100/100 VUs, 50836 complete and 0 interrupted iterations
feed   [  51% ] 100 VUs  1m01.0s/2m0s

running (1m02.0s), 100/100 VUs, 51783 complete and 0 interrupted iterations
feed   [  52% ] 100 VUs  1m02.0s/2m0s

running (1m03.0s), 100/100 VUs, 52700 complete and 0 interrupted iterations
feed   [  52% ] 100 VUs  1m03.0s/2m0s

running (1m04.0s), 100/100 VUs, 53632 complete and 0 interrupted iterations
feed   [  53% ] 100 VUs  1m04.0s/2m0s

running (1m05.0s), 100/100 VUs, 54553 complete and 0 interrupted iterations
feed   [  54% ] 100 VUs  1m05.0s/2m0s

running (1m06.0s), 100/100 VUs, 55532 complete and 0 interrupted iterations
feed   [  55% ] 100 VUs  1m06.0s/2m0s

running (1m07.0s), 100/100 VUs, 56378 complete and 0 interrupted iterations
feed   [  56% ] 100 VUs  1m07.0s/2m0s

running (1m08.0s), 100/100 VUs, 57369 complete and 0 interrupted iterations
feed   [  57% ] 100 VUs  1m08.0s/2m0s

running (1m09.0s), 100/100 VUs, 58284 complete and 0 interrupted iterations
feed   [  57% ] 100 VUs  1m09.0s/2m0s

running (1m10.0s), 100/100 VUs, 59207 complete and 0 interrupted iterations
feed   [  58% ] 100 VUs  1m10.0s/2m0s

running (1m11.0s), 100/100 VUs, 60130 complete and 0 interrupted iterations
feed   [  59% ] 100 VUs  1m11.0s/2m0s

running (1m12.0s), 100/100 VUs, 61019 complete and 0 interrupted iterations
feed   [  60% ] 100 VUs  1m12.0s/2m0s

running (1m13.0s), 100/100 VUs, 61919 complete and 0 interrupted iterations
feed   [  61% ] 100 VUs  1m13.0s/2m0s

running (1m14.0s), 100/100 VUs, 62882 complete and 0 interrupted iterations
feed   [  62% ] 100 VUs  1m14.0s/2m0s

running (1m15.0s), 100/100 VUs, 63819 complete and 0 interrupted iterations
feed   [  62% ] 100 VUs  1m15.0s/2m0s

running (1m16.0s), 100/100 VUs, 64758 complete and 0 interrupted iterations
feed   [  63% ] 100 VUs  1m16.0s/2m0s

running (1m17.0s), 100/100 VUs, 65707 complete and 0 interrupted iterations
feed   [  64% ] 100 VUs  1m17.0s/2m0s

running (1m18.0s), 100/100 VUs, 66641 complete and 0 interrupted iterations
feed   [  65% ] 100 VUs  1m18.0s/2m0s

running (1m19.0s), 100/100 VUs, 67514 complete and 0 interrupted iterations
feed   [  66% ] 100 VUs  1m19.0s/2m0s

running (1m20.0s), 100/100 VUs, 68450 complete and 0 interrupted iterations
feed   [  67% ] 100 VUs  1m20.0s/2m0s

running (1m21.0s), 100/100 VUs, 69421 complete and 0 interrupted iterations
feed   [  67% ] 100 VUs  1m21.0s/2m0s

running (1m22.0s), 100/100 VUs, 70296 complete and 0 interrupted iterations
feed   [  68% ] 100 VUs  1m22.0s/2m0s

running (1m23.0s), 100/100 VUs, 71224 complete and 0 interrupted iterations
feed   [  69% ] 100 VUs  1m23.0s/2m0s

running (1m24.0s), 100/100 VUs, 72138 complete and 0 interrupted iterations
feed   [  70% ] 100 VUs  1m24.0s/2m0s

running (1m25.0s), 100/100 VUs, 73045 complete and 0 interrupted iterations
feed   [  71% ] 100 VUs  1m25.0s/2m0s

running (1m26.0s), 100/100 VUs, 73989 complete and 0 interrupted iterations
feed   [  72% ] 100 VUs  1m26.0s/2m0s

running (1m27.0s), 100/100 VUs, 74945 complete and 0 interrupted iterations
feed   [  72% ] 100 VUs  1m27.0s/2m0s

running (1m28.0s), 100/100 VUs, 75870 complete and 0 interrupted iterations
feed   [  73% ] 100 VUs  1m28.0s/2m0s

running (1m29.0s), 100/100 VUs, 76845 complete and 0 interrupted iterations
feed   [  74% ] 100 VUs  1m29.0s/2m0s

running (1m30.0s), 100/100 VUs, 77778 complete and 0 interrupted iterations
feed   [  75% ] 100 VUs  1m30.0s/2m0s

running (1m31.0s), 100/100 VUs, 78651 complete and 0 interrupted iterations
feed   [  76% ] 100 VUs  1m31.0s/2m0s

running (1m32.0s), 100/100 VUs, 79583 complete and 0 interrupted iterations
feed   [  77% ] 100 VUs  1m32.0s/2m0s

running (1m33.0s), 100/100 VUs, 80483 complete and 0 interrupted iterations
feed   [  77% ] 100 VUs  1m33.0s/2m0s

running (1m34.0s), 100/100 VUs, 81383 complete and 0 interrupted iterations
feed   [  78% ] 100 VUs  1m34.0s/2m0s

running (1m35.0s), 100/100 VUs, 82203 complete and 0 interrupted iterations
feed   [  79% ] 100 VUs  1m35.0s/2m0s

running (1m36.0s), 100/100 VUs, 83152 complete and 0 interrupted iterations
feed   [  80% ] 100 VUs  1m36.0s/2m0s

running (1m37.0s), 100/100 VUs, 84096 complete and 0 interrupted iterations
feed   [  81% ] 100 VUs  1m37.0s/2m0s

running (1m38.0s), 100/100 VUs, 85021 complete and 0 interrupted iterations
feed   [  82% ] 100 VUs  1m38.0s/2m0s

running (1m39.0s), 100/100 VUs, 85930 complete and 0 interrupted iterations
feed   [  82% ] 100 VUs  1m39.0s/2m0s

running (1m40.0s), 100/100 VUs, 86892 complete and 0 interrupted iterations
feed   [  83% ] 100 VUs  1m40.0s/2m0s

running (1m41.0s), 100/100 VUs, 87836 complete and 0 interrupted iterations
feed   [  84% ] 100 VUs  1m41.0s/2m0s

running (1m42.0s), 100/100 VUs, 88746 complete and 0 interrupted iterations
feed   [  85% ] 100 VUs  1m42.0s/2m0s

running (1m43.0s), 100/100 VUs, 89702 complete and 0 interrupted iterations
feed   [  86% ] 100 VUs  1m43.0s/2m0s

running (1m44.0s), 100/100 VUs, 90657 complete and 0 interrupted iterations
feed   [  87% ] 100 VUs  1m44.0s/2m0s

running (1m45.0s), 100/100 VUs, 91615 complete and 0 interrupted iterations
feed   [  87% ] 100 VUs  1m45.0s/2m0s

running (1m46.0s), 100/100 VUs, 92557 complete and 0 interrupted iterations
feed   [  88% ] 100 VUs  1m46.0s/2m0s

running (1m47.0s), 100/100 VUs, 93529 complete and 0 interrupted iterations
feed   [  89% ] 100 VUs  1m47.0s/2m0s

running (1m48.0s), 100/100 VUs, 94457 complete and 0 interrupted iterations
feed   [  90% ] 100 VUs  1m48.0s/2m0s

running (1m49.0s), 100/100 VUs, 95399 complete and 0 interrupted iterations
feed   [  91% ] 100 VUs  1m49.0s/2m0s

running (1m50.0s), 100/100 VUs, 96352 complete and 0 interrupted iterations
feed   [  92% ] 100 VUs  1m50.0s/2m0s

running (1m51.0s), 100/100 VUs, 97316 complete and 0 interrupted iterations
feed   [  92% ] 100 VUs  1m51.0s/2m0s

running (1m52.0s), 100/100 VUs, 98234 complete and 0 interrupted iterations
feed   [  93% ] 100 VUs  1m52.0s/2m0s

running (1m53.0s), 100/100 VUs, 99157 complete and 0 interrupted iterations
feed   [  94% ] 100 VUs  1m53.0s/2m0s

running (1m54.0s), 100/100 VUs, 100060 complete and 0 interrupted iterations
feed   [  95% ] 100 VUs  1m54.0s/2m0s

running (1m55.0s), 100/100 VUs, 100986 complete and 0 interrupted iterations
feed   [  96% ] 100 VUs  1m55.0s/2m0s

running (1m56.0s), 100/100 VUs, 101965 complete and 0 interrupted iterations
feed   [  97% ] 100 VUs  1m56.0s/2m0s

running (1m57.0s), 100/100 VUs, 102894 complete and 0 interrupted iterations
feed   [  97% ] 100 VUs  1m57.0s/2m0s

running (1m58.0s), 100/100 VUs, 103810 complete and 0 interrupted iterations
feed   [  98% ] 100 VUs  1m58.0s/2m0s

running (1m59.0s), 100/100 VUs, 104770 complete and 0 interrupted iterations
feed   [  99% ] 100 VUs  1m59.0s/2m0s

running (2m00.0s), 100/100 VUs, 105699 complete and 0 interrupted iterations
feed   [ 100% ] 100 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration{name:post/feed}
    ✓ 'p(95)<1000' p(95)=13.68ms


  █ TOTAL RESULTS 

    checks_total.......: 211612 1762.102051/s
    checks_succeeded...: 91.46% 193558 out of 211612
    checks_failed......: 8.53%  18054 out of 211612

    ✗ feed 200
      ↳  91% — ✓ 96779 / ✗ 9027
    ✗ feed has 30-40 posts
      ↳  91% — ✓ 96779 / ✗ 9027

    HTTP
    http_req_duration..............: min=512.4µs  avg=12.49ms  med=5.44ms   p(90)=11.01ms  p(95)=13.68ms p(99)=22.23ms  max=5.9s    
      { expected_response:true }...: min=548.79µs avg=6.73ms   med=5.42ms   p(90)=10.52ms  p(95)=12.77ms p(99)=17.93ms  max=469.66ms
      { name:post/feed }...........: min=512.4µs  avg=12.49ms  med=5.44ms   p(90)=11.01ms  p(95)=13.68ms p(99)=22.23ms  max=5.9s    
    http_req_failed................: 8.53%  9027 out of 105806
    http_reqs......................: 105806 881.051025/s

    EXECUTION
    iteration_duration.............: min=100.93ms avg=113.45ms med=106.27ms p(90)=112.54ms p(95)=115.5ms p(99)=124.56ms max=6.02s   
    iterations.....................: 105806 881.051025/s
    vus............................: 100    min=100            max=100
    vus_max........................: 100    min=100            max=100

    NETWORK
    data_received..................: 319 MB 2.7 MB/s
    data_sent......................: 35 MB  291 kB/s



running (2m00.1s), 000/100 VUs, 105806 complete and 0 interrupted iterations
feed ✓ [ 100% ] 100 VUs  2m0s